Page({
  data: {
    list: [
      {
        id: 'view',
        name: '最常用到',
        open: false,
        subName: ['学生综合事务中心', '保卫处', '校医室','图书馆','心理咨询','校园卡中心'],
        phone: ['0752-2529130', '0752-2529110', '0752-2527126', '0752-2527255', '0752-2529291', '0752-2527076']
      }, {
        id: 'jwc',
        name: '教务处',
        open: false,
        subName: ['学籍管理', '考务管理', '选课管理', '评课管理', '教材服务中心'],
        phone: ['0752-2527804', '0752-2529282', '0752-2527804', '0752-2529143', '0752-2529270']
      }, {
        id: 'wlwt',
        name: '网络问题',
        open: false,
        subName: ['咨询', '保修', '投诉'],
        phone: ['0752-7832911', '0752-2119124', '0752-2529230']
      }, {
        id: 'xyjw',
        name: '学院教务',
        open: false,
        subName: ['电子学院', '文传学院', '地旅学院', '政法学院', '化工学院', '经管学院','建土学院','教科学院','数学学院','音乐学院','体育学院','外国语学院','生命科学学院','美术设计学院','信息科学技术学院','继续教育学院','马克思主义学院'],
        phone: ['0752-2527271', '0752-2529190', '0752-2529365', '0752-2529170', '0752-2527229', '0752-2529733', '0752-2529038', '0752-2529033', '0752-2529102', '0752-2121575', '0752-2529165', '0752-2529278', '0752-2529555', '0752-2529507', '0752-2529450', '0752-2529810','0752-2527799']
      }, {
        id: 'hqc',
        name: '后勤处',
        open: false,
        subName: ['学生公寓管理中心', '学术交流中心住宿', '后勤基建处', '土木维修中心', '水电管理中心'],
        phone: ['0752-2527877', '0752-7211999', '0752-2527832', '0752-2527813', '0752-2529685']
      }, {
        id: 'zsb',
        name: '招生办',
        subName: ['咨询', '申诉'],
        phone: ['0752-2527803', '0752-2527273']
      }, {
        id: 'xsc',
        name: '学生处',
        subName: ['综合事务中心', '心理咨询', '助贷中心', '毕业就业指导中心', '思政与教育管理科'],
        phone: ['0752-2529130', '0752-2529291', '0752-2527262', '0752-2527099', '0752-2529619']
      }, 
      
    ]
  },
  widgetsToggle: function (e) {
    var id = e.currentTarget.id, list = this.data.list;
    for (var i = 0, len = list.length; i < len; ++i) {
      if (list[i].id == id) {
        list[i].open = !list[i].open;
      } else {
        list[i].open = false;
      }
    }
    this.setData({
      list: list
    });
  },
  callPhone: function (e) {
    wx.makePhoneCall({
      phoneNumber: e.target.dataset.phone
    })
  }
});
